Вояж = {"Мексика","Канада","Израиль","Италия","США"}
РейнаТур = {"Англия","Япония","Канада","ЮАР"}
Радуга = {"США","Испания","Швеция","Австралия","Италия","Канада"}
list_firms = []

"""
Определить:
- в каких турагенствах можно приобрести туры в Италию и Канаду
- в турагенство РейнаТур добавить тур в Индию
- полный список всех туров     
"""

def checkTours(tours,firma):
    try:
        if "Италия" in tours and "Канада" in tours:
            list_firms.append(firma)
    except Exception as e:
        print("Возникла ошибка при работе функции:",e)

checkTours(Вояж,"Вояж")
checkTours(РейнаТур, "РейнаТур")
checkTours(Радуга, "Радуга")

print("Туры в Италию и Канаду можно приобрести в турагенствах:", " , ".join(map(str,list_firms)))
print("")
print(" , ".join(map(str,РейнаТур)))
РейнаТур.add("Индия")
print(" , ".join(map(str,РейнаТур)))

print("Список всех доступных туров:", " , ".join(map(str,(Вояж|РейнаТур|Радуга))))